Revit 2026 API

# ScheduleDefinitionShowGrandTotalCount Property

---

Indicates if the grand total row should display a count of elements in the schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ShowGrandTotalCount { get; set; }
```
```vb
Public Property ShowGrandTotalCount As Boolean
	Get
	Set
```
```cpp
public:
property bool ShowGrandTotalCount {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ShowGrandTotalCount : bool with get, set
```

#### Property Value

Boolean True if an element count should be displayed, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: Display of a grand total row is not enabled. |

ShowGrandTotalCount can only be enabled if ShowGrandTotal is enabled.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace